Tekla.Structures.Drawing.RadiusDimension
The RadiusDimension class defines a radius dimension that displays the radius of the given arc.
using Tekla.Structures.Drawing;
using Tekla.Structures.Geometry3d;
public class Example
{
public void Example1()
{
DrawingHandler MyDrawingHandler = new DrawingHandler();
ViewBase _view = MyDrawingHandler.GetActiveDrawing().GetSheet().GetAllViews().Current as ViewBase;
RadiusDimension basicDimension = new RadiusDimension(_view,
new Point(-1000, 0, 0),
new Point(0, 1000, 0),
new Point(1000, 0, 0),
200);
}
}

Tekla.Structures.Drawing.RadiusDimension.Attributes
The radius dimension attributes.

Tekla.Structures.Drawing.RadiusDimension.Distance
Gets or sets the distance.

Tekla.Structures.Drawing.RadiusDimension.ArcPoint1
Gets the first arc point.

Tekla.Structures.Drawing.RadiusDimension.ArcPoint2
Gets the second arc point.

Tekla.Structures.Drawing.RadiusDimension.ArcPoint3
Gets the third arc point.

Tekla.Structures.Drawing.RadiusDimension.#ctor(Tekla.Structures.Drawing.ViewBase,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point,System.Double)
Creates a new radius dimension instance using three points and the distance.
View: The view to be used.
ArcPoint1: The first arc point to be used.
ArcPoint2: The second arc point to be used.
ArcPoint3: The third arc point to be used.
Distance: The distance to be used.

Tekla.Structures.Drawing.RadiusDimension.#ctor(Tekla.Structures.Drawing.ViewBase,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point,System.Double,Tekla.Structures.Drawing.RadiusDimensionAttributes)
Creates a new radius dimension instance with the attributes, three points and the distance.
View: The view to be used.
ArcPoint1: The first arc point to be used.
ArcPoint2: The second arc point to be used.
ArcPoint3: The third arc point to be used.
Distance: The distance to be used.
Attributes: The attributes to be used.

Tekla.Structures.Drawing.RadiusDimension.GetDimensionSet
Radius dimensions don't have dimension sets.
Returns: An exception.
Throws System.InvalidOperationException: Thrown always.

Tekla.Structures.Drawing.RadiusDimension.GetDimensionSet(System.Boolean)
Radius dimensions don't have dimension sets.
Select: Whether to select the object from the database or not.
Returns: An exception.
Throws System.InvalidOperationException: Thrown always.

Tekla.Structures.Drawing.RadiusDimension.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.

Tekla.Structures.Drawing.RadiusDimension.QueryOperation(Tekla.Structures.DrawingInternal.QueryTypeEnum)
Communicates with Tekla Structures core.
OperationType: The type of the executed operation.
Returns: True on success.

Tekla.Structures.Drawing.RadiusDimension.Insert
Inserts the dimension into the database.
Returns: True if the insertion succeeds.

Tekla.Structures.Drawing.RadiusDimension.Select
Selects the radius dimension from the database.
Returns: True if the selection succeeds.

Tekla.Structures.Drawing.RadiusDimension.Modify
Modifies the existing dimension in the database.
Returns: True if the updating succeeds.

Tekla.Structures.Drawing.RadiusDimension.Delete
Deletes the dimension from the database.
Returns: True if the deletion succeeds.